In [1]:
import pandas as pd

In [9]:
df = pd.read_csv("/workspaces/chronic_absenteeism/chronicabsenteeism24.txt", delimiter="\t", encoding="ISO-8859-1")
df

,Academic Year,Aggregate Level,County Code,District Code,School Code,County Name,District Name,School Name,Charter School,DASS,Reporting Category,ChronicAbsenteeismEligibleCumulativeEnrollment,ChronicAbsenteeismCount,ChronicAbsenteeismRate
0,2023-24,T,0,NaN,NaN,State,NaN,NaN,All,All,GF,2893392,590593,20.4
1,2023-24,T,0,NaN,NaN,State,NaN,NaN,All,All,GM,3059188,623926,20.4
2,2023-24,T,0,NaN,NaN,State,NaN,NaN,All,All,GR13,1252549,219754,17.5
3,2023-24,T,0,NaN,NaN,State,NaN,NaN,All,All,GR46,1311437,209968,16
4,2023-24,T,0,NaN,NaN,State,NaN,NaN,All,All,GR78,896631,172257,19.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
343597,2023-24,C,58,NaN,NaN,Yuba,NaN,NaN,Yes,Yes,SE,19,5,26.3
343598,2023-24,C,58,NaN,NaN,Yuba,NaN,NaN,Yes,Yes,SF,*,*,*
343599,2023-24,C,58,NaN,NaN,Yuba,NaN,NaN,Yes,Yes,SH,25,9,36
343600,2023-24,C,58,NaN,NaN,Yuba,NaN,NaN,Yes,Yes,SS,265,74,27.9
343601,2023-24,C,58,NaN,NaN,Yuba,NaN,NaN,Yes,Yes,TA,295,79,26.8

In [20]:
cleaned_df = df.copy()
cleaned_df.columns = cleaned_df.columns.str.lower().str.replace(" ", "_")
cleaned_df.rename(columns={"chronicabsenteeismeligiblecumulativeenrollment": "abs_cumulative_enrollment",
                           "chronicabsenteeismcount": "abs_count",
                           "chronicabsenteeismrate": "abs_rate"
                           }, inplace=True)

cleaned_df

,academic_year,aggregate_level,county_code,district_code,school_code,county_name,district_name,school_name,charter_school,dass,reporting_category,abs_cumulative_enrollment,abs_count,abs_rate
0,2023-24,T,0,NaN,NaN,State,NaN,NaN,All,All,GF,2893392,590593,20.4
1,2023-24,T,0,NaN,NaN,State,NaN,NaN,All,All,GM,3059188,623926,20.4
2,2023-24,T,0,NaN,NaN,State,NaN,NaN,All,All,GR13,1252549,219754,17.5
3,2023-24,T,0,NaN,NaN,State,NaN,NaN,All,All,GR46,1311437,209968,16
4,2023-24,T,0,NaN,NaN,State,NaN,NaN,All,All,GR78,896631,172257,19.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
343597,2023-24,C,58,NaN,NaN,Yuba,NaN,NaN,Yes,Yes,SE,19,5,26.3
343598,2023-24,C,58,NaN,NaN,Yuba,NaN,NaN,Yes,Yes,SF,*,*,*
343599,2023-24,C,58,NaN,NaN,Yuba,NaN,NaN,Yes,Yes,SH,25,9,36
343600,2023-24,C,58,NaN,NaN,Yuba,NaN,NaN,Yes,Yes,SS,265,74,27.9
343601,2023-24,C,58,NaN,NaN,Yuba,NaN,NaN,Yes,Yes,TA,295,79,26.8

In [30]:
# T = state, C = county, D = district, S = school
cleaned_df["aggregate_level"].value_counts()
# to numeric
cleaned_df[["abs_cumulative_enrollment", "abs_count", "abs_rate"]] = cleaned_df[["abs_cumulative_enrollment", "abs_count", "abs_rate"]].apply(pd.to_numeric, errors="coerce")

# create state level filter and sub dateset
state_filter = cleaned_df["aggregate_level"]== "T"
df_state = cleaned_df.loc[state_filter]

# create county level filter and sub dataset
county_filter = cleaned_df["aggregate_level"]== "C"
df_county = cleaned_df.loc[county_filter]

# summary statistics
#df_state["abs_cumulative_enrollment"].describe()
#df_state["abs_count"].describe()
#df_state["abs_rate"].describe()
df_state.loc[df_state["reporting_category"]=="SF"]

,academic_year,aggregate_level,county_code,district_code,school_code,county_name,district_name,school_name,charter_school,dass,reporting_category,abs_cumulative_enrollment,abs_count,abs_rate
21,2023-24,T,0,NaN,NaN,State,NaN,NaN,All,All,SF,38194.0,14124.0,37.0
47,2023-24,T,0,NaN,NaN,State,NaN,NaN,All,No,SF,35291.0,12180.0,34.5
72,2023-24,T,0,NaN,NaN,State,NaN,NaN,All,Yes,SF,4512.0,2762.0,61.2
98,2023-24,T,0,NaN,NaN,State,NaN,NaN,No,All,SF,35037.0,12833.0,36.6
124,2023-24,T,0,NaN,NaN,State,NaN,NaN,No,No,SF,33149.0,11637.0,35.1
149,2023-24,T,0,NaN,NaN,State,NaN,NaN,No,Yes,SF,3048.0,1749.0,57.4
174,2023-24,T,0,NaN,NaN,State,NaN,NaN,Yes,All,SF,4470.0,1897.0,42.4
199,2023-24,T,0,NaN,NaN,State,NaN,NaN,Yes,No,SF,2859.0,843.0,29.5
224,2023-24,T,0,NaN,NaN,State,NaN,NaN,Yes,Yes,SF,1636.0,1065.0,65.1

In [47]:
# SH - Homeless; SF - Foster
df_state_hm = df_state.loc[df_state["reporting_category"].isin(["SF", "SH"])]
# abs_rate (highly mobile students) = 36.4% - state level

In [42]:
# Rural, suburban, urban

# Define the list of urban counties
urban_counties = [
    "Alameda", "Contra Costa", "Fresno", "Los Angeles", "Orange", "Riverside", 
    "Sacramento", "San Bernardino", "San Diego", "San Francisco", "San Joaquin", 
    "San Mateo", "Santa Clara", "Ventura"
]

# Define the list of suburban counties
suburban_counties = [
    "Butte", "Imperial", "Kern", "Marin", "Merced", "Monterey", "Napa", "Placer",
    "San Luis Obispo", "Santa Barbara", "Santa Cruz", "Shasta", "Solano",
    "Sonoma", "Stanislaus", "Tulare", "Yolo"
]

# Define the list of rural counties
rural_counties = [
    "Alpine", "Amador", "Calaveras", "Colusa", "Del Norte", "El Dorado", "Glenn",
    "Humboldt", "Inyo", "Kings", "Lake", "Lassen", "Madera", "Mariposa", "Mendocino",
    "Modoc", "Mono", "Nevada", "Plumas", "San Benito", "Sierra", "Siskiyou",
    "Sutter", "Tehama", "Trinity", "Tuolumne", "Yuba"
]
# Apply the filter
urban_filter = df_county["county_name"].isin(urban_counties)
# Apply the filter
suburban_filter = df_county["county_name"].isin(suburban_counties)
# Apply the filter
rural_filter = df_county["county_name"].isin(rural_counties)

# create three separate dataset
df_urban = df_county.loc[urban_filter]
df_suburban = df_county.loc[suburban_filter]
df_rural = df_county.loc[rural_filter]

In [46]:
df_urban_hm = df_urban.loc[df_urban["reporting_category"].isin(["SF", "SH"])]
df_urban_hm

,academic_year,aggregate_level,county_code,district_code,school_code,county_name,district_name,school_name,charter_school,dass,reporting_category,abs_cumulative_enrollment,abs_count,abs_rate
331917,2023-24,C,1,NaN,NaN,Alameda,NaN,NaN,All,All,SF,715.0,370.0,51.7
331918,2023-24,C,1,NaN,NaN,Alameda,NaN,NaN,All,All,SH,5478.0,2636.0,48.1
331942,2023-24,C,1,NaN,NaN,Alameda,NaN,NaN,All,No,SF,628.0,310.0,49.4
331943,2023-24,C,1,NaN,NaN,Alameda,NaN,NaN,All,No,SH,4953.0,2199.0,44.4
331967,2023-24,C,1,NaN,NaN,Alameda,NaN,NaN,All,Yes,SF,109.0,62.0,56.9
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
343129,2023-24,C,56,NaN,NaN,Ventura,NaN,NaN,Yes,All,SH,256.0,131.0,51.2
343153,2023-24,C,56,NaN,NaN,Ventura,NaN,NaN,Yes,No,SF,NaN,NaN,NaN
343154,2023-24,C,56,NaN,NaN,Ventura,NaN,NaN,Yes,No,SH,78.0,8.0,10.3
343175,2023-24,C,56,NaN,NaN,Ventura,NaN,NaN,Yes,Yes,SF,45.0,39.0,86.7
343176,2023-24,C,56,NaN,NaN,Ventura,NaN,NaN,Yes,Yes,SH,178.0,122.0,68.5